XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_sent.h
/**
  *******************************************************************************************************
  * @file    fm33lf0xx_fl_sent.h
  * @author  FMSH Application Team
  * @brief   Head file of SENT FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LF0XX_FL_SENT_H
#define __FM33LF0XX_FL_SENT_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lf0xx_fl_def.h"
/** @addtogroup FM33LA0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_ES_INIT SENT Exported Init structures
  * @{
  */

/**
  * @brief FL SENT Init Sturcture definition
  */
typedef struct
{
	/*配置接收发送*/
    uint32_t transferDirection;
	/*时钟预分频*/
    uint32_t prescaler;
    /*发送模式*/
    uint32_t transmitMode;
	/*数据Nibble个数*/
    uint32_t dataNibbleNumber;
	/*硬件CRC*/
    uint32_t hardwareCRC;
	/*CRC模式*/
    uint32_t CRCMode;
	/*暂停脉冲*/
    uint32_t pausePulse;
	/*发送帧长度*/
    uint32_t frameTime;
	/*空闲时输出电平*/
    uint32_t idleoutputpulse;
	/*sync长度范围最大值*/
    uint32_t syncPulseMax;
	/*sync长度范围最小值*/
    uint32_t syncPulseMin;
} FL_SENT_InitTypeDef;


/**
  * @brief    
  */
typedef enum
{
    FL_SENT_NIBBLE_STATUS,
    FL_SENT_NIBBLE_DATA_1ST,
    FL_SENT_NIBBLE_DATA_2ST,
    FL_SENT_NIBBLE_DATA_3ST,
    FL_SENT_NIBBLE_DATA_4ST,
    FL_SENT_NIBBLE_DATA_5ST,
    FL_SENT_NIBBLE_DATA_6ST,
    FL_SENT_NIBBLE_CRC
}fl_sent_nib_type;
/**
  * @brief    
  */
typedef enum
{
    FL_SENT_PAUSESTATUS_NO_TXANDRX,
    FL_SENT_PAUSESTATUS_TXANDRX
}fl_sent_pause_type;

/**
  * @brief    
  */
typedef enum
{
    FL_SENT_SYNCSTATUS_NO_TXANDRX,
    FL_SENT_SYNCSTATUS_TXANDRX
}fl_sent_sync_type;


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_Exported_Constants SENT Exported Constants
  * @{
  */

#define    SENT_CR_RXEN_Pos                                       (1U)
#define    SENT_CR_RXEN_Msk                                       (0x1U << SENT_CR_RXEN_Pos)
#define    SENT_CR_RXEN                                           SENT_CR_RXEN_Msk

#define    SENT_CR_TXEN_Pos                                       (0U)
#define    SENT_CR_TXEN_Msk                                       (0x1U << SENT_CR_TXEN_Pos)
#define    SENT_CR_TXEN                                           SENT_CR_TXEN_Msk

#define    SENT_CFGR_FTXIE_Pos                                    (21U)
#define    SENT_CFGR_FTXIE_Msk                                    (0x1U << SENT_CFGR_FTXIE_Pos)
#define    SENT_CFGR_FTXIE                                        SENT_CFGR_FTXIE_Msk

#define    SENT_CFGR_NTXIE_Pos                                    (20U)
#define    SENT_CFGR_NTXIE_Msk                                    (0x1U << SENT_CFGR_NTXIE_Pos)
#define    SENT_CFGR_NTXIE                                        SENT_CFGR_NTXIE_Msk

#define    SENT_CFGR_SYNCIE_Pos                                   (19U)
#define    SENT_CFGR_SYNCIE_Msk                                   (0x1U << SENT_CFGR_SYNCIE_Pos)
#define    SENT_CFGR_SYNCIE                                       SENT_CFGR_SYNCIE_Msk

#define    SENT_CFGR_ERRIE_Pos                                    (18U)
#define    SENT_CFGR_ERRIE_Msk                                    (0x1U << SENT_CFGR_ERRIE_Pos)
#define    SENT_CFGR_ERRIE                                        SENT_CFGR_ERRIE_Msk

#define    SENT_CFGR_FRXIE_Pos                                    (17U)
#define    SENT_CFGR_FRXIE_Msk                                    (0x1U << SENT_CFGR_FRXIE_Pos)
#define    SENT_CFGR_FRXIE                                        SENT_CFGR_FRXIE_Msk

#define    SENT_CFGR_NRXIE_Pos                                    (16U)
#define    SENT_CFGR_NRXIE_Msk                                    (0x1U << SENT_CFGR_NRXIE_Pos)
#define    SENT_CFGR_NRXIE                                        SENT_CFGR_NRXIE_Msk

#define    SENT_CFGR_NIBCNT_Pos                                   (8U)
#define    SENT_CFGR_NIBCNT_Msk                                   (0x7U << SENT_CFGR_NIBCNT_Pos)
#define    SENT_CFGR_NIBCNT                                       SENT_CFGR_NIBCNT_Msk

#define    SENT_CFGR_CRCM_Pos                                     (5U)
#define    SENT_CFGR_CRCM_Msk                                     (0x1U << SENT_CFGR_CRCM_Pos)
#define    SENT_CFGR_CRCM                                         SENT_CFGR_CRCM_Msk

#define    SENT_CFGR_PPEN_Pos                                     (4U)
#define    SENT_CFGR_PPEN_Msk                                     (0x1U << SENT_CFGR_PPEN_Pos)
#define    SENT_CFGR_PPEN                                         SENT_CFGR_PPEN_Msk

#define    SENT_CFGR_CRCEN_Pos                                    (3U)
#define    SENT_CFGR_CRCEN_Msk                                    (0x1U << SENT_CFGR_CRCEN_Pos)
#define    SENT_CFGR_CRCEN                                        SENT_CFGR_CRCEN_Msk

#define    SENT_CFGR_TXPOL_Pos                                    (2U)
#define    SENT_CFGR_TXPOL_Msk                                    (0x1U << SENT_CFGR_TXPOL_Pos)
#define    SENT_CFGR_TXPOL                                        SENT_CFGR_TXPOL_Msk

#define    SENT_CFGR_TXM_Pos                                      (1U)
#define    SENT_CFGR_TXM_Msk                                      (0x1U << SENT_CFGR_TXM_Pos)
#define    SENT_CFGR_TXM                                          SENT_CFGR_TXM_Msk

