XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_sent.h
#define    SENT_CFGR_MOD_Pos                                      (0U)
#define    SENT_CFGR_MOD_Msk                                      (0x1U << SENT_CFGR_MOD_Pos)
#define    SENT_CFGR_MOD                                          SENT_CFGR_MOD_Msk

#define    SENT_PSR_PRESCALER_Pos                                 (0U)
#define    SENT_PSR_PRESCALER_Msk                                 (0xffffU << SENT_PSR_PRESCALER_Pos)
#define    SENT_PSR_PRESCALER                                     SENT_PSR_PRESCALER_Msk

#define    SENT_FTR_FRAMETIME_Pos                                 (0U)
#define    SENT_FTR_FRAMETIME_Msk                                 (0xfffU << SENT_FTR_FRAMETIME_Pos)
#define    SENT_FTR_FRAMETIME                                     SENT_FTR_FRAMETIME_Msk

#define    SENT_SR_NIB_Pos                                        (19U)
#define    SENT_SR_NIB_Msk                                        (0x7U << SENT_SR_NIB_Pos)
#define    SENT_SR_NIB                                            SENT_SR_NIB_Msk

#define    SENT_SR_RXIDLE_Pos                                     (18U)
#define    SENT_SR_RXIDLE_Msk                                     (0x1U << SENT_SR_RXIDLE_Pos)
#define    SENT_SR_RXIDLE                                         SENT_SR_RXIDLE_Msk

#define    SENT_SR_PAUSE_Pos                                      (17U)
#define    SENT_SR_PAUSE_Msk                                      (0x1U << SENT_SR_PAUSE_Pos)
#define    SENT_SR_PAUSE                                          SENT_SR_PAUSE_Msk

#define    SENT_SR_SYNC_Pos                                       (16U)
#define    SENT_SR_SYNC_Msk                                       (0x1U << SENT_SR_SYNC_Pos)
#define    SENT_SR_SYNC                                           SENT_SR_SYNC_Msk

#define    SENT_SR_TCOERR_Pos                                     (13U)
#define    SENT_SR_TCOERR_Msk                                     (0x1U << SENT_SR_TCOERR_Pos)
#define    SENT_SR_TCOERR                                         SENT_SR_TCOERR_Msk

#define    SENT_SR_SSERR_Pos                                      (12U)
#define    SENT_SR_SSERR_Msk                                      (0x1U << SENT_SR_SSERR_Pos)
#define    SENT_SR_SSERR                                          SENT_SR_SSERR_Msk

#define    SENT_SR_NBERR_Pos                                      (11U)
#define    SENT_SR_NBERR_Msk                                      (0x1U << SENT_SR_NBERR_Pos)
#define    SENT_SR_NBERR                                          SENT_SR_NBERR_Msk

#define    SENT_SR_CRCERR_Pos                                     (10U)
#define    SENT_SR_CRCERR_Msk                                     (0x1U << SENT_SR_CRCERR_Pos)
#define    SENT_SR_CRCERR                                         SENT_SR_CRCERR_Msk

#define    SENT_SR_NCNTERR_Pos                                    (9U)
#define    SENT_SR_NCNTERR_Msk                                    (0x1U << SENT_SR_NCNTERR_Pos)
#define    SENT_SR_NCNTERR                                        SENT_SR_NCNTERR_Msk

#define    SENT_SR_SYNCERR_Pos                                    (8U)
#define    SENT_SR_SYNCERR_Msk                                    (0x1U << SENT_SR_SYNCERR_Pos)
#define    SENT_SR_SYNCERR                                        SENT_SR_SYNCERR_Msk

#define    SENT_SR_FTXF_Pos                                       (5U)
#define    SENT_SR_FTXF_Msk                                       (0x1U << SENT_SR_FTXF_Pos)
#define    SENT_SR_FTXF                                           SENT_SR_FTXF_Msk

#define    SENT_SR_NTXF_Pos                                       (4U)
#define    SENT_SR_NTXF_Msk                                       (0x1U << SENT_SR_NTXF_Pos)
#define    SENT_SR_NTXF                                           SENT_SR_NTXF_Msk

#define    SENT_SR_SYNCF_Pos                                      (3U)
#define    SENT_SR_SYNCF_Msk                                      (0x1U << SENT_SR_SYNCF_Pos)
#define    SENT_SR_SYNCF                                          SENT_SR_SYNCF_Msk

#define    SENT_SR_FRXF_Pos                                       (1U)
#define    SENT_SR_FRXF_Msk                                       (0x1U << SENT_SR_FRXF_Pos)
#define    SENT_SR_FRXF                                           SENT_SR_FRXF_Msk

#define    SENT_SR_NRXF_Pos                                       (0U)
#define    SENT_SR_NRXF_Msk                                       (0x1U << SENT_SR_NRXF_Pos)
#define    SENT_SR_NRXF                                           SENT_SR_NRXF_Msk

#define    SENT_DR_CRC_Pos                                        (28U)
#define    SENT_DR_CRC_Msk                                        (0xfU << SENT_DR_CRC_Pos)
#define    SENT_DR_CRC                                            SENT_DR_CRC_Msk

#define    SENT_DR_DATA6_Pos                                      (24U)
#define    SENT_DR_DATA6_Msk                                      (0xfU << SENT_DR_DATA6_Pos)
#define    SENT_DR_DATA6                                          SENT_DR_DATA6_Msk

#define    SENT_DR_DATA5_Pos                                      (20U)
#define    SENT_DR_DATA5_Msk                                      (0xfU << SENT_DR_DATA5_Pos)
#define    SENT_DR_DATA5                                          SENT_DR_DATA5_Msk

#define    SENT_DR_DATA4_Pos                                      (16U)
#define    SENT_DR_DATA4_Msk                                      (0xfU << SENT_DR_DATA4_Pos)
#define    SENT_DR_DATA4                                          SENT_DR_DATA4_Msk

#define    SENT_DR_DATA3_Pos                                      (12U)
#define    SENT_DR_DATA3_Msk                                      (0xfU << SENT_DR_DATA3_Pos)
#define    SENT_DR_DATA3                                          SENT_DR_DATA3_Msk

#define    SENT_DR_DATA2_Pos                                      (8U)
#define    SENT_DR_DATA2_Msk                                      (0xfU << SENT_DR_DATA2_Pos)
#define    SENT_DR_DATA2                                          SENT_DR_DATA2_Msk

#define    SENT_DR_DATA1_Pos                                      (4U)
#define    SENT_DR_DATA1_Msk                                      (0xfU << SENT_DR_DATA1_Pos)
#define    SENT_DR_DATA1                                          SENT_DR_DATA1_Msk

#define    SENT_DR_STATUS_Pos                                     (0U)
#define    SENT_DR_STATUS_Msk                                     (0xfU << SENT_DR_STATUS_Pos)
#define    SENT_DR_STATUS                                         SENT_DR_STATUS_Msk

#define    SENT_SYNC_SYNCMAX_Pos                                  (16U)
#define    SENT_SYNC_SYNCMAX_Msk                                  (0xfffU << SENT_SYNC_SYNCMAX_Pos)
#define    SENT_SYNC_SYNCMAX                                      SENT_SYNC_SYNCMAX_Msk

#define    SENT_SYNC_SYNCMIN_Pos                                  (0U)
#define    SENT_SYNC_SYNCMIN_Msk                                  (0xfffU << SENT_SYNC_SYNCMIN_Pos)
#define    SENT_SYNC_SYNCMIN                                      SENT_SYNC_SYNCMIN_Msk

#define    SENT_RCAL_BASECNT_Pos                                  (16U)
#define    SENT_RCAL_BASECNT_Msk                                  (0x3fU << SENT_RCAL_BASECNT_Pos)
#define    SENT_RCAL_BASECNT                                      SENT_RCAL_BASECNT_Msk

#define    SENT_RCAL_RCAL_Pos                                     (0U)
#define    SENT_RCAL_RCAL_Msk                                     (0xfffU << SENT_RCAL_RCAL_Pos)
#define    SENT_RCAL_RCAL                                         SENT_RCAL_RCAL_Msk






#define    FL_SENT_DATANIBBLES_COUNT_FORBIDDEN                    (0x0U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_1N                           (0x1U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_2N                           (0x2U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_3N                           (0x3U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_4N                           (0x4U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_5N                           (0x5U << SENT_CFGR_NIBCNT_Pos)
#define    FL_SENT_DATANIBBLES_COUNT_6N                           (0x6U << SENT_CFGR_NIBCNT_Pos)


#define    FL_SENT_CRCMODE_RECOMMENDED                            (0x0U << SENT_CFGR_CRCM_Pos)
#define    FL_SENT_CRCMODE_LEGACY                                 (0x1U << SENT_CFGR_CRCM_Pos)

#define    FL_SENT_IDLEOUTPUT_HIGH                                (0x0U << SENT_CFGR_TXPOL_Pos)
#define    FL_SENT_IDLEOUTPUT_LOW                                 (0x1U << SENT_CFGR_TXPOL_Pos)


#define    FL_SENT_TXMODE_SOFTWARE                                (0x0U << SENT_CFGR_TXM_Pos)
#define    FL_SENT_TXMODE_SERIAL                                  (0x1U << SENT_CFGR_TXM_Pos)


#define    FL_SENT_MODE_RX                                        (0x0U << SENT_CFGR_MOD_Pos)
#define    FL_SENT_MODE_TX                                        (0x1U << SENT_CFGR_MOD_Pos)


#define    FL_SENT_NIBBLE_STATUS                                  (0x0U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_1ST                                (0x1U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_2ST                                (0x2U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_3ST                                (0x3U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_4ST                                (0x4U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_5ST                                (0x5U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_DATA_6ST                                (0x6U << SENT_SR_NIB_Pos)
#define    FL_SENT_NIBBLE_CRC                                     (0x7U << SENT_SR_NIB_Pos)

#define    FL_SENT_PAUSESTATUS_TXANDRX                            (0x1U << SENT_SR_PAUSE_Pos)
#define    FL_SENT_PAUSESTATUS_NO_TXANDRX                         (0x0U << SENT_SR_PAUSE_Pos)

