XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_sent.h
#define    FL_SENT_SYNCSTATUS_TXANDRX                             (0x1U << SENT_SR_SYNC_Pos)
#define    FL_SENT_SYNCSTATUS_NO_TXANDRX                          (0x0U << SENT_SR_SYNC_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup SENT_FL_Exported_Functions SENT Exported Functions
  * @{
  */

/**
  * @brief    SENT receive enable  
  * @rmtoll   CR    RXEN    FL_SENT_EnableRX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableRX(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CR, SENT_CR_RXEN_Msk);
}

/**
  * @brief    SENT receive disable  
  * @rmtoll   CR    RXEN    FL_SENT_DisableRX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableRX(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CR, SENT_CR_RXEN_Msk);
}

/**
  * @brief    Get SENT receive enable status
  * @rmtoll   CR    RXEN    FL_SENT_IsEnableRX
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnableRX(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CR, SENT_CR_RXEN_Msk) == SENT_CR_RXEN_Msk);
}

/**
  * @brief    SENT transmit enable  
  * @rmtoll   CR    TXEN    FL_SENT_EnableTX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableTX(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CR, SENT_CR_TXEN_Msk);
}

/**
  * @brief    SENT transmit disable  
  * @rmtoll   CR    TXEN    FL_SENT_DisableTX
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableTX(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CR, SENT_CR_TXEN_Msk);
}

/**
  * @brief    Get SENT transmit enable status  
  * @rmtoll   CR    TXEN    FL_SENT_IsEnableTX
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnableTX(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CR, SENT_CR_TXEN_Msk) == SENT_CR_TXEN_Msk);
}

/**
  * @brief    Enable frame transmit complete interrupt
  * @rmtoll   CFGR    FTXIE    FL_SENT_EnableIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Disable frame transmit complete interrupt
  * @rmtoll   CFGR    FTXIE    FL_SENT_DisableIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Get frame transmit complete interrupt status
  * @rmtoll   CFGR    FTXIE    FL_SENT_IsEnabledIT_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_FrameTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_FTXIE_Msk) == SENT_CFGR_FTXIE_Msk);
}

/**
  * @brief    Enable nibble transmit complete interrupt
  * @rmtoll   CFGR    NTXIE    FL_SENT_EnableIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Disable nibble transmit complete interrupt
  * @rmtoll   CFGR    NTXIE    FL_SENT_DisableIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Get nibble transmit complete interrupt status
  * @rmtoll   CFGR    NTXIE    FL_SENT_IsEnabledIT_NibbleTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_NibbleTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NTXIE_Msk) == SENT_CFGR_NTXIE_Msk);
}

/**
  * @brief    Enable Sync pulse transmit complete interrupt
  * @rmtoll   CFGR    SYNCIE    FL_SENT_EnableIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Disable Sync pulse transmit complete interrupt
  * @rmtoll   CFGR    SYNCIE    FL_SENT_DisableIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Get Sync pulse transmit complete interrupt status
  * @rmtoll   CFGR    SYNCIE    FL_SENT_IsEnabledIT_SyncPulseReceiveCorrectly
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_SyncPulseReceiveCorrectly(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_SYNCIE_Msk) == SENT_CFGR_SYNCIE_Msk);
}

/**
  * @brief    Enable ErrEvent transmit complete interrupt
  * @rmtoll   CFGR    ERRIE    FL_SENT_EnableIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Disable ErrEvent transmit complete interrupt
  * @rmtoll   CFGR    ERRIE    FL_SENT_DisableIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Get ErrEvent transmit complete interrupt status
  * @rmtoll   CFGR    ERRIE    FL_SENT_IsEnabledIT_ErrEventsOccurred
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_ErrEventsOccurred(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_ERRIE_Msk) == SENT_CFGR_ERRIE_Msk);
}

/**
  * @brief    Enable frame receive complete interrupt
  * @rmtoll   CFGR    FRXIE    FL_SENT_EnableIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Disable frame receive complete interrupt
  * @rmtoll   CFGR    FRXIE    FL_SENT_DisableIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Get frame receive complete interrupt status
  * @rmtoll   CFGR    FRXIE    FL_SENT_IsEnabledIT_FrameReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_FrameReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_FRXIE_Msk) == SENT_CFGR_FRXIE_Msk);
}

/**
  * @brief    Enable nibble receive complete interrupt
  * @rmtoll   CFGR    NRXIE    FL_SENT_EnableIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Disable nibble receive complete interrupt
  * @rmtoll   CFGR    NRXIE    FL_SENT_DisableIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Get nibble receive complete interrupt status
  * @rmtoll   CFGR    NRXIE    FL_SENT_IsEnabledIT_NibbleReceiveComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledIT_NibbleReceiveComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NRXIE_Msk) == SENT_CFGR_NRXIE_Msk);
}

/**
  * @brief    Set data nibbles count
  * @rmtoll   CFGR    NIBCNT    FL_SENT_SetDataNibblesCount
  * @param    SENTx SENT instance
  * @param    nibblecount This parameter can be one of the following values:
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_FORBIDDEN
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_1N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_2N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_3N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_4N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_5N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_6N
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetDataNibblesCount(SENT_Type* SENTx, uint32_t nibblecount)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_NIBCNT_Msk, nibblecount);
}

/**
  * @brief    Get data nibbles count
  * @rmtoll   CFGR    NIBCNT    FL_SENT_GetDataNibblesCount
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_FORBIDDEN
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_1N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_2N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_3N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_4N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_5N
  *           @arg @ref FL_SENT_DATANIBBLES_COUNT_6N
  */
__STATIC_INLINE uint32_t FL_SENT_GetDataNibblesCount(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_NIBCNT_Msk));
}

/**
  * @brief    Set CRC mode
  * @rmtoll   CFGR    CRCM    FL_SENT_SetCRCModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_CRCMODE_RECOMMENDED
  *           @arg @ref FL_SENT_CRCMODE_LEGACY
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetCRCModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_CRCM_Msk, mode);
}

/**
  * @brief    Get CRC mode
  * @rmtoll   CFGR    CRCM    FL_SENT_GetCRCModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_CRCMODE_RECOMMENDED
  *           @arg @ref FL_SENT_CRCMODE_LEGACY
  */
__STATIC_INLINE uint32_t FL_SENT_GetCRCModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_CRCM_Msk));
}

/**
  * @brief    Enable pause pulse
  * @rmtoll   CFGR    PPEN    FL_SENT_EnablePausePulse
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnablePausePulse(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Disable pause pulse
  * @rmtoll   CFGR    PPEN    FL_SENT_DisablePausePulse
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisablePausePulse(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Get pause pulse status
  * @rmtoll   CFGR    PPEN    FL_SENT_IsEnabledPausePulse
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledPausePulse(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_PPEN_Msk) == SENT_CFGR_PPEN_Msk);
}

/**
  * @brief    Enable hardware CRC
  * @rmtoll   CFGR    CRCEN    FL_SENT_EnableCRCHardware
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_EnableCRCHardware(SENT_Type* SENTx)
{
    SET_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Disable hardware CRC
  * @rmtoll   CFGR    CRCEN    FL_SENT_DisableCRCHardware
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_DisableCRCHardware(SENT_Type* SENTx)
{
    CLEAR_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Get hardware CRC status
  * @rmtoll   CFGR    CRCEN    FL_SENT_IsEnabledCRCHardware
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsEnabledCRCHardware(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_CRCEN_Msk) == SENT_CFGR_CRCEN_Msk);
}

/**
  * @brief    Set idle transmit output pulse
  * @rmtoll   CFGR    TXPOL    FL_SENT_SetIdleTXOutputPulse
  * @param    SENTx SENT instance
  * @param    pulse This parameter can be one of the following values:
  *           @arg @ref FL_SENT_OUTPUT_HIGH
  *           @arg @ref FL_SENT_OUTPUT_LOW
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetIdleTXOutputPulse(SENT_Type* SENTx, uint32_t pulse)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_TXPOL_Msk, pulse);
}

/**
  * @brief    Get idle transmit output pulse status
  * @rmtoll   CFGR    TXPOL    FL_SENT_GetIdleTXOutputPulse
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_OUTPUT_HIGH
  *           @arg @ref FL_SENT_OUTPUT_LOW
  */
__STATIC_INLINE uint32_t FL_SENT_GetIdleTXOutputPulse(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_TXPOL_Msk));
}

/**
  * @brief    Set transmit mode
  * @rmtoll   CFGR    TXM    FL_SENT_SetTXModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_TXMODE_SOFTWARE
  *           @arg @ref FL_SENT_TXMODE_SERIAL
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetTXModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_TXM_Msk, mode);
}

/**
  * @brief    Get transmit mode
  * @rmtoll   CFGR    TXM    FL_SENT_GetTXModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_TXMODE_SOFTWARE
  *           @arg @ref FL_SENT_TXMODE_SERIAL
  */
__STATIC_INLINE uint32_t FL_SENT_GetTXModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_TXM_Msk));
}

/**
  * @brief    Set receive mode
  * @rmtoll   CFGR    MOD    FL_SENT_SetModeSelect
  * @param    SENTx SENT instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SENT_MODE_RX
  *           @arg @ref FL_SENT_MODE_TX
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_SetModeSelect(SENT_Type* SENTx, uint32_t mode)
{
    MODIFY_REG(SENTx->CFGR, SENT_CFGR_MOD_Msk, mode);
}

/**
  * @brief    Get receive mode
  * @rmtoll   CFGR    MOD    FL_SENT_GetModeSelect
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_MODE_RX
  *           @arg @ref FL_SENT_MODE_TX
  */
__STATIC_INLINE uint32_t FL_SENT_GetModeSelect(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->CFGR, SENT_CFGR_MOD_Msk));
}

/**
  * @brief    Write sent time prescaler
  * @rmtoll   PSR    PRESCALER    FL_SENT_WritePrescaler
  * @param    SENTx SENT instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WritePrescaler(SENT_Type* SENTx, uint32_t psc)
{
    MODIFY_REG(SENTx->PSR, (0xffffU << 0U), (psc << 0U));
}

/**
  * @brief    Read sent time prescaler
  * @rmtoll   PSR    PRESCALER    FL_SENT_ReadPrescaler
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadPrescaler(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->PSR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Write receive frame length
  * @rmtoll   FTR    FRAMETIME    FL_SENT_WriteFrameTimeLength
  * @param    SENTx SENT instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_WriteFrameTimeLength(SENT_Type* SENTx, uint32_t length)
{
    MODIFY_REG(SENTx->FTR, (0xfffU << 0U), (length << 0U));
}

/**
  * @brief    Read transmit frame length
  * @rmtoll   FTR    FRAMETIME    FL_SENT_ReadFrameTimeLength
  * @param    SENTx SENT instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_SENT_ReadFrameTimeLength(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->FTR, (0xfffU << 0U)) >> 0U);
}

/**
  * @brief    Get nibble transmit and receive status
  * @rmtoll   SR    NIB    FL_SENT_GetTransmitAndReceiveNibbleStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_NIBBLE_STATUS
  *           @arg @ref FL_SENT_NIBBLE_DATA_1ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_2ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_3ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_4ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_5ST
  *           @arg @ref FL_SENT_NIBBLE_DATA_6ST
  *           @arg @ref FL_SENT_NIBBLE_CRC
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceiveNibbleStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NIB_Msk));
}

/**
  * @brief    Get idle receive status
  * @rmtoll   SR    RXIDLE    FL_SENT_GetRxdleStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_SENT_GetRxdleStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_RXIDLE_Msk));
}

/**
  * @brief    Get pause transmit and receive status
  * @rmtoll   SR    PAUSE    FL_SENT_GetTransmitAndReceivePauseStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_PAUSESTATUS_TXANDRX
  *           @arg @ref FL_SENT_PAUSESTATUS_NO_TXANDRX
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceivePauseStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_PAUSE_Msk));
}

/**
  * @brief    Get sync status
  * @rmtoll   SR    SYNC    FL_SENT_GetTransmitAndReceiveSyncStatus
  * @param    SENTx SENT instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SENT_SYNCSTATUS_TXANDRX
  *           @arg @ref FL_SENT_SYNCSTATUS_NO_TXANDRX
  */
__STATIC_INLINE uint32_t FL_SENT_GetTransmitAndReceiveSyncStatus(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SYNC_Msk));
}

/**
  * @brief    Get tick counter overflow error tick 
  * @rmtoll   SR    TCOERR    FL_SENT_IsActiveFlag_TickCounterOverflowErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_TickCounterOverflowErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_TCOERR_Msk) == (SENT_SR_TCOERR_Msk));
}

/**
  * @brief    Clear flag :tick counter overflow error tick 
  * @rmtoll   SR    TCOERR    FL_SENT_ClearFlag_TickCounterOverflowErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_TickCounterOverflowErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_TCOERR_Msk);
}

/**
  * @brief    Get successive sync error
  * @rmtoll   SR    SSERR    FL_SENT_IsActiveFlag_SuccessiveSyncErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_SuccessiveSyncErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SSERR_Msk) == (SENT_SR_SSERR_Msk));
}

/**
  * @brief    Clear flag :successive sync error
  * @rmtoll   SR    SSERR    FL_SENT_ClearFlag_SuccessiveSyncErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_SuccessiveSyncErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_SSERR_Msk);
}

/**
  * @brief    Get nibble ticks count error
  * @rmtoll   SR    NBERR    FL_SENT_IsActiveFlag_NibbleTicksCountErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibbleTicksCountErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NBERR_Msk) == (SENT_SR_NBERR_Msk));
}

/**
  * @brief    Clear flag :nibble ticks count error
  * @rmtoll   SR    NBERR    FL_SENT_ClearFlag_NibbleTicksCountErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibbleTicksCountErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NBERR_Msk);
}

/**
  * @brief    Get CRC check error
  * @rmtoll   SR    CRCERR    FL_SENT_IsActiveFlag_CRCCheckErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_CRCCheckErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_CRCERR_Msk) == (SENT_SR_CRCERR_Msk));
}

/**
  * @brief    Clear flag :CRC check error
  * @rmtoll   SR    CRCERR    FL_SENT_ClearFlag_CRCCheckErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_CRCCheckErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_CRCERR_Msk);
}

/**
  * @brief    Get nibbles count error
  * @rmtoll   SR    NCNTERR    FL_SENT_IsActiveFlag_NibblesCountErr
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibblesCountErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NCNTERR_Msk) == (SENT_SR_NCNTERR_Msk));
}

/**
  * @brief    Clear flag : nibbles count error
  * @rmtoll   SR    NCNTERR    FL_SENT_ClearFlag_NibblesCountErr
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibblesCountErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NCNTERR_Msk);
}

/**
  * @brief    Get sync pusle width error
  * @rmtoll   SR    SYNCERR    FL_SENT_IsActiveFlag_SyncPusleWidth
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_SyncPusleWidthErr(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_SYNCERR_Msk) == (SENT_SR_SYNCERR_Msk));
}

/**
  * @brief    Clear flag :sync pusle width error
  * @rmtoll   SR    SYNCERR    FL_SENT_ClearFlag_SyncPusleWidth
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_SyncPusleWidthErr(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_SYNCERR_Msk);
}

/**
  * @brief    Get frame transmit complete flag
  * @rmtoll   SR    FTXF    FL_SENT_IsActiveFlag_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_FrameTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_FTXF_Msk) == (SENT_SR_FTXF_Msk));
}

/**
  * @brief    Clear flag :frame transmit complete flag
  * @rmtoll   SR    FTXF    FL_SENT_ClearFlag_FrameTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_FrameTransmitComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_FTXF_Msk);
}

/**
  * @brief    Get nibble transmit complete flag
  * @rmtoll   SR    NTXF    FL_SENT_IsActiveFlag_NibblesTransmitComplete
  * @param    SENTx SENT instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SENT_IsActiveFlag_NibblesTransmitComplete(SENT_Type* SENTx)
{
    return (uint32_t)(READ_BIT(SENTx->SR, SENT_SR_NTXF_Msk) == (SENT_SR_NTXF_Msk));
}

/**
  * @brief    Clear flag :nibble transmit complete flag
  * @rmtoll   SR    NTXF    FL_SENT_ClearFlag_NibblesTransmitComplete
  * @param    SENTx SENT instance
  * @retval   None
  */
__STATIC_INLINE void FL_SENT_ClearFlag_NibblesTransmitComplete(SENT_Type* SENTx)
{
    WRITE_REG(SENTx->SR, SENT_SR_NTXF_Msk);
}

